<h1>Руководство к задаче 4411 на С#</h1>
<a href="../[2] лаб. ОСАЛП.html#task4411" target="_blank">открыть условие задачи в новой вкладке</a>



<div id="step1" class="step">
<h4>Шаг 1/3</h4>
<a href="#initial">К вступлению</a>
<p>У вас должен получиться код, похожий на фрагмент ниже.</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {
            String data;
            data = Console.ReadLine();
            double x;
            x = double.Parse(data);</span>
            double result;
            Console.Write("Результат: {0:F4}", result);
        <span class="comment">}
    }
}</span></p>
<p>Следующим шагом нужно оформить вычисление результата. Команда выглядит вот так:</p>
<p class="preformatted">result = x + 7;</p>
<p>Выражение "result = ..." как и раньше это "присвоить переменной result значение ...". А значение получается при сложении переменной x и числа 7.</p>
<p>Предположите, что получится, если вычисление оформить так:</p>
<p class="preformatted">data = x + 7;</p>
<p>Или так:</p>
<p class="preformatted">result = data + 7;</p>
<p>Попробуйте написать такой код и запустить. Подтвердилось ли ваше предположение?</p>
<a href="#step2">К шагу 2</a>
</div>



<div id="step2" class="step">
<h4>Шаг 2/3</h4>
<a href="#step1">К шагу 1</a> <a href="#initial">К вступлению</a>
<p>Верный вариант решения этой задачи выглядит так:</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {
            String data;
            data = Console.ReadLine();
            double x;
            x = double.Parse(data);
            double result;</span>
            result = x + 7;
            <span class="comment">Console.Write("Результат: {0:F4}", result);
        }
    }
}</span></p>
<p>Отдельные части арифметического выражения названы терминами: <span style="color:red;">операторы</span> и <span style="color:green;">операнды</span>. Оператор это действие, а операнд - то над чем оно выполняется. Если отметить их цветом в решаемой задаче, то получится так:</p>
<p><zoom>result = <span style="color:green">x</span>
<span style="color:red;">+</span>
<span style="color:green;">7</span>;</zoom> <span class="comment">Строго говоря, "result" это тоже операнд, а "=" это тоже оператор.</span></p>
<p>В языке поддерживается множество операторов. На данный момент нам интересны следующие:
<table>
<tr>
  <td><zoom>*</zoom></td><td>умножение</td>
  <td><zoom>/</zoom></td><td>деление</td>
  <td><zoom>+</zoom></td><td>сложение чисел или склеивание строк</td>
  <td><zoom>-</zoom></td><td>вычитание</td>
</tr>
</table></p>
<p>Операнды намного более разнообразны. Ими могут быть:
<ul>
<li>Литералы. Т.е. числа, написанные в коде.</li>
<li>Переменные.</li>
<li>Выражения в круглых скобках.</li>
<li>Вызовы методов. Такие операторы будут рассмотрены позже.</li>
</ul></p>
<p>Как правило, операнды должны быть совместимы с операторами. Например "+" можно использовать для работы со строками, а "-", "*" и "/" нельзя. Строки и числа можно склеить в одну строку оператором "+", но оператор "*" в том же выражении приведет к синтаксической ошибке.</p>
<p>Как вы думаете, есть ли подобные ограничения при работе с целыми и дробными (действительными) числами?</p>
<a href="#step3">К шагу 3</a>
</div>


<div id="step3" class="step">
<h4>Шаг 3/3</h4>
<a href="#step2">К шагу 2</a> <a href="#initial">К вступлению</a>
<p>Выражения можно составлять из множества операндов и операторов. Например так:</p>
<p class="preformatted">distance = initialVelocity * time + (acceleration * time * time) / 2;</p>
<p>Выражения с несколькими операторами компьютер разбивает на несколько шагов и затем последовательно их выполняет. Сначала вычисляются выражения в скобках. Затем порядок определяется приоритетом операторов. Например умножение и деление вычисляются раньше сложения и вычитания.</p>
<p>Фрагмент выше можно преобразовать в следующий набор команд без потери смысла:</p>
<p class="preformatted">step0 = acceleration * time;
step1 = step0 * time;
step2 = step1 / 2;
step3 = initialVelocity * time;
distance = step3 + step2;</p>
<p>Это просто иллюстрация действий компьютера. Такая запись - крайность, которая редко встречается в реальном коде.</p>
<p>Подробную информацию о приоритете операторов можно найти в <a href="https://msdn.microsoft.com/ru-ru/library/2bxt6kc4.aspx">документации</a>.</p>
<p>Будьте внимательны при работе с натуральными дробями. Одна из самых распространенных ошибок происходит во время преобразования выражений вроде такого:</p>
<formula>
	d=
	<fraction>
		<numerator>a + b</numerator>
		<denominator>c</denominator>
	</fraction>
</formula>
<p>По правилам вычислений таких выражений, сначала нужно сложить "a" с "b". А на "c" нужно делить полученную сумму. Если потерять бдительность, то получится:</p>
<p class="preformatted">d = a + b / c;</p>
<p>Но это не правильно. В этом случае компьютер сначала разделит "b" на "c" и затем уже прибавит "a". Такой порядок действий определен приоритетом операторов в языке.</p>
<p>Правильный вариант выглядит так:</p>
<p class="preformatted">d = (a + b) / c;</p>
<p>В нем были использованы скобочки, чтобы комьютер сначала сложил числа "a" с "b" и их сумму разделил на "c".</p>
<p>Другой правильный вариант выглядит так:</p>
<p class="preformatted">sum = a + b;
d = sum / c;</p>
<p>Для компьютера нет существенной разницы между этими двумя способами. Дополнительные переменные вводят для того, чтобы упростить чтение сложных вычислений человеком. Это важно, потому что код чаще читают, чем пишут.</p>
<a href="#initial">К вступлению</a>
</div>


<div id="initial" class="step">
<h4>Вступление</h4>
<p>В предыдущем разборе теории <a href="pre9231.html#initial" target="_blank">(открыть в новой вкладке)</a> был рассмотрен ввод чисел с клавиатуры.</p>
<p>Сейчас будет разобран пример оформления вычислений в программе.</p>
<p>Прежде чем отдавать компьютеру команду "посчитай результат", нужно понять назначение каждой переменной.</p>
<p>Какие переменные были объявлены в фрагменте программы ниже?</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {</span>
            String data;
            data = Console.ReadLine();
            double x;
            x = double.Parse(data);
        <span class="comment">}
    }
}</span></p>
<p>Их всего две:<ul>
    <li>data - нужна чтобы получить значение от пользователя в текстовом виде.</li>
    <li>x - нужна для хранения значения от пользователя в виде числа (действительного)</li>
</ul></p>
<p>Для хранения результата будет полезно создать еще одну переменную. В абстрактной задаче ее можно назвать просто "result". Если же в задаче, к примеру, дата плотность тела и его объем, а нужно найти массу, то переменным нужно дать более осмысленные названия: density, volume, mass.</p>
<p>Добавьте команду объявления переменной для результата и команду для вывода ее в консоль с нужной точностью.</p>
<a href="#step1">К шагу 1</a>
</div>