<h1>Руководство к задаче 7711 на С#</h1>
<a href="../[2] лаб. ОСАЛП.html#task7711" target="_blank">открыть условие задачи в новой вкладке</a>


<div id="step1" class="step">
<h4>Шаг 1/3</h4>
<a href="#initial">К вступлению</a>
<p>У вас должен получиться код, похожий на фрагмент ниже.</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {
            String temp;
            temp = Console.ReadLine();
            double aDeg;
            double aRad;
            aDeg = double.Parse(temp);
            aRad = aDeg * Math.PI / 180;</span>
            double result = Math.Sin(aRad);
            <span class="comment">Console.WriteLine("{0:F4}", result);
        }
    }
}</span></p>
<p>Вызов метода можно писать как часть арифметического выражения. Следующий код тоже даст верный результат.</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {
            String temp;
            temp = Console.ReadLine();
            double aDeg;
            aDeg = double.Parse(temp);</span>
            double result = Math.Sin(aDeg * Math.PI / 180);
            <span class="comment">Console.WriteLine("{0:F4}", result);
        }
    }
}</span></p>
<p>Нахождение синуса угла - не единственное применение методов. Более того, мы уже применяли методы раньше.</p>
<a href="#step2">К шагу 2</a>
</div>


<div id="step2" class="step">
<h4>Шаг 2/3</h4>
<a href="#step1">К шагу 1</a> <a href="#initial">К вступлению</a>
<p>Обратите внимание, что выражение "Console.ReadLine" и "double.Parse" это тоже вызовы метода. Это значит, что код программы можно переписать без потери смысла вот так:</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {</span>
            double result = Math.Sin(double.Parse(Console.ReadLine()) * Math.PI / 180);
            <span class="comment">Console.WriteLine("{0:F4}", result);
        }
    }
}</span></p>
<p>Попробуйте выразить в одну строку программу расчета по формуле <formula>result = sin(a) + cos(a)</formula>. Значение переменной "a" вводится пользователем один раз, но используется в двух местах формулы. Метод для нахождения косинуса угла называется "Math.Cos" и он тоже ожидает значение в радианах.</p>
<a href="#step3">К шагу 3</a>
</div>

<div id="step3" class="step">
<h4>Шаг 3/3</h4>
<a href="#step2">К шагу 2</a> <a href="#initial">К вступлению</a>
<p>Выражение не удастся написать в одну строку, когда одно и то же значение переменной "a" используется несколько раз. Поэтому ее значение так или иначе придется записать в отдельную переменную.</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {</span>
            double aRad = double.Parse(Console.ReadLine()) * Math.PI / 180;
            double result = Math.Sin(aRad) + Math.Cos(aRad);
            <span class="comment">Console.WriteLine("{0:F4}", result);
        }
    }
}</span></p>
<p>Подробный и сокращенный способ оформления для компьютера выглядят одинаково и выполняются с равной скоростью. Отличие есть только для людей, читающих код.</p>
<a href="#initial">К вступлению</a>
</div>

<div id="initial" class="step">
<h4>Вступление</h4>
<p>В предыдущем разборе теории <a href="pre4411.html#initial" target="_blank">(открыть в новой вкладке)</a> были рассмотрены арифметические операторы и простые операнды.</p>
<p>Сейчас будет разобран пример использования операнда - "Вызов метода".</p>
<p>Один из способов применения методов - оформление сложных вычислений: возведения в степень, нахождения синуса угла или квадратного корня числа. Есть и другие способы. О них будет рассказано в других лабораторных работах.</p>
<p>Различные методы применяются похожим способом. Для объяснения принципа, рассмотрим метод нахождения синуса угла. Допустим значение угла было записано в переменную "aRad". Тогда после выполнения команды:</p>
<p class="preformatted">double result = Math.Sin(aRad);</p>
<p>В переменную "result" будет записано значение синуса для угла "aRad".</p>
<p>Выражение <span class="preformatted">Math.Sin</span> это название метода. Сразу после него, в круглых скобках пишутся аргументы метода.</p>
<p>В качестве аргументов метода можно передавать переменные, числа и целые выражения</p>
<p>Обратите внимание, что метод "Math.Sin" ожидает значение в радианах, а исходные данные в задаче указаны в градусах. Поэтому прежде чем вычислять синус, нужно перевести исходные данные из градусов в радианы.</p>
<p>Ожидаю, что вы это делали в предыдущей задаче <a href="../[2] лаб. ОСАЛП.html#task8428">(открыть в новой вкладке)</a>. Предполагаю, что оно выглядит так:</p>
<p class="preformatted"><span class="comment">using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example
{
    class Program
    {
        static void Main(string[] args)
        {</span>
            String temp;
            temp = Console.ReadLine();
            double aDeg;
            double aRad;
            aDeg = double.Parse(temp);
            aRad = aDeg * Math.PI / 180;
            Console.WriteLine("{0:F4}", aRad);
        <span class="comment">}
    }
}</span></p>
<p>К этому алгоритму нужно добавить команду вычисления синуса.</p>
<a href="#step1">К шагу 1</a>
</div>